In [1]:
import pandas as pd
import numpy as np

In [25]:
pd.read_csv('train.csv')['Pclass']

0      3
1      1
2      3
3      1
4      3
      ..
886    2
887    1
888    3
889    1
890    3
Name: Pclass, Length: 891, dtype: int64

In [21]:
type(pd.read_csv('train.csv'))

pandas.core.frame.DataFrame

In [20]:
type(pd.read_csv('train.csv')['PassengerId'])

pandas.core.series.Series

In [29]:
type(data_dict)

dict

In [27]:
data_dict = {"names":['A','B','C','D'],"Marks":[1,2,3,4]}

In [32]:
pd.DataFrame(data_dict).to_csv('data_dict.csv',index=False)

In [35]:
df_1 = pd.read_csv('data_dict.csv')

In [37]:
df_1.index = ['m1','m2','m3','m4']

In [43]:
df_1['Marks']['m4'] = 100

<ipython-input-43-ce520af3c226>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  df_1['Marks']['m4'] = 100

In [47]:
df_1[['names']]

   names
m1     A
m2     B
m3     C
m4     D

In [8]:
pd.DataFrame(data_dict).to_csv('my_df.csv',index = False)

In [10]:
data_1 = pd.DataFrame(data_dict)

In [13]:
data_1.index = ['M1','M2','M3','M4']

In [16]:
data_1['Marks']['M1'] = 10

<ipython-input-16-6aeb40ac9dd3>:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  data_1['Marks']['M1'] = 10

In [17]:
data_1

   names  Marks
M1     A     10
M2     B      2
M3     C      3
M4     D      4

In [19]:
data_1[['names']]

   names
M1     A
M2     B
M3     C
M4     D

In [6]:
rand_df = pd.DataFrame(np.random.rand(2,3))

In [8]:
rand_df.columns = ['A','B','C']

In [10]:
rand_df.index = ['I1','I2']

In [12]:
random_df = pd.DataFrame(np.random.rand(34,5),index = np.arange(34),columns=np.arange(5))

In [20]:
random_df.T

,0,1,2,3,4,5,6,7,8,9,...,24,25,26,27,28,29,30,31,32,33
0,0.331376,0.789552,0.905016,0.895005,0.123853,0.830379,0.184888,0.989270,0.042162,0.190330,...,0.569577,0.990821,0.433955,0.308992,0.517745,0.610939,0.161756,0.545743,0.774022,0.282219
1,0.986584,0.456498,0.748677,0.337776,0.740471,0.476746,0.005855,0.094536,0.116416,0.893627,...,0.899468,0.480721,0.781890,0.771305,0.453630,0.931306,0.968931,0.510987,0.713358,0.473583
2,0.760436,0.364181,0.548486,0.806864,0.656942,0.580066,0.190048,0.152041,0.624103,0.196520,...,0.974668,0.957579,0.886057,0.543942,0.047936,0.736315,0.734687,0.445615,0.397182,0.658918
3,0.428159,0.356219,0.883466,0.984157,0.236838,0.412826,0.189951,0.940300,0.412187,0.894530,...,0.735124,0.851167,0.363517,0.821779,0.585900,0.600753,0.742558,0.907414,0.513705,0.238051
4,0.958776,0.091989,0.246878,0.927363,0.094173,0.728835,0.785502,0.345818,0.072474,0.635391,...,0.946279,0.029046,0.114835,0.160118,0.264614,0.026730,0.050670,0.151026,0.993502,0.405386

In [21]:
random_df.index

Int64Index([ 0,  1,  2,  3,  4,  5,  6,  7,  8,  9, 10, 11, 12, 13, 14, 15, 16,
            17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32,
            33],
           dtype='int64')

In [5]:
random_df.sort_index()

           0         1         2         3         4
0   0.801613  0.801620  0.336871  0.836825  0.018148
1   0.728559  0.310003  0.470348  0.007596  0.717552
2   0.835019  0.667377  0.369851  0.754025  0.205030
3   0.232422  0.137140  0.874774  0.586238  0.714258
4   0.480535  0.221001  0.267978  0.879056  0.121672
5   0.987905  0.264475  0.688563  0.805678  0.773792
6   0.699501  0.054112  0.192938  0.980358  0.010009
7   0.645934  0.584447  0.547416  0.423428  0.131002
8   0.472201  0.156217  0.012270  0.752279  0.454582
9   0.798959  0.527165  0.049869  0.253252  0.951972
10  0.593547  0.748695  0.141083  0.760855  0.888486
11  0.656630  0.858245  0.523703  0.760097  0.318453
12  0.253827  0.556601  0.235768  0.592888  0.427530
13  0.033314  0.930130  0.076253  0.084065  0.746194
14  0.147902  0.576714  0.548621  0.864716  0.990050
15  0.634874  0.033568  0.672334  0.963916  0.528136
16  0.921556  0.741444  0.599357  0.119276  0.411630
17  0.079486  0.063242  0.670843  0.863038  0.623449
18  0.681894  0.561335  0.641558  0.294687  0.401733
19  0.062181  0.427722  0.251112  0.699202  0.344970
20  0.376527  0.348611  0.254303  0.385317  0.967010
21  0.178318  0.829837  0.294416  0.316123  0.646698
22  0.013815  0.519173  0.894522  0.364332  0.267030
23  0.632022  0.128406  0.330608  0.557336  0.633534
24  0.106063  0.219051  0.639369  0.685763  0.508701
25  0.430409  0.876319  0.267856  0.254997  0.746200
26  0.045542  0.090256  0.420708  0.393073  0.448843
27  0.377436  0.290304  0.643646  0.208753  0.118978
28  0.566789  0.124077  0.908562  0.926810  0.066792
29  0.619463  0.945642  0.093813  0.763508  0.119119
30  0.142467  0.388035  0.895927  0.900672  0.667842
31  0.611946  0.968527  0.310649  0.640824  0.955450
32  0.248923  0.601062  0.421661  0.319869  0.749472
33  0.754806  0.314428  0.521943  0.564109  0.625215

In [6]:
# views in Pandas dataframe.

In [7]:
random_df.loc[0,0] = 1345

In [11]:
random_df.columns = list("ABCDE")

In [30]:
random_df.columns = list("ABCDE")

In [46]:
random_df.head(8)

             A         B         C         D            E
0     0.331376  0.986584  0.760436  0.428159     0.958776
1  1234.000000  0.456498  0.364181  0.356219     0.091989
2     0.905016  0.748677  0.548486  0.883466     0.246878
3     0.895005  0.337776  0.806864  0.984157     0.927363
4     0.123853  0.740471  0.656942  0.236838     0.094173
5     0.830379  0.476746  0.580066  0.412826     0.728835
6     0.184888  0.005855  0.190048  0.189951  7896.000000
7     0.989270  0.094536  0.152041  0.940300     0.345818

In [45]:
random_df.loc[6,'E'] = 7896

In [49]:
random_df.iloc[6,1]

0.005854957584868203

In [48]:
random_df.iloc[0,1]

0.9865836556178597

In [13]:
random_df.loc[0,'A'] = 1

In [15]:
random_df.drop('E',axis=1,inplace=True)

In [17]:
random_df.head(4)

          A         B         C         D
0  1.000000  0.801620  0.336871  0.836825
1  0.728559  0.310003  0.470348  0.007596
2  0.835019  0.667377  0.369851  0.754025
3  0.232422  0.137140  0.874774  0.586238

In [50]:
random_df.loc[[1,2],['A','C']]

             A         C
1  1234.000000  0.364181
2     0.905016  0.548486

In [54]:
random_df.loc[(random_df['B']<0.5) & (random_df['C']>0.7)]

           A         B         C         D         E
3   0.895005  0.337776  0.806864  0.984157  0.927363
16  0.416488  0.139756  0.928766  0.177143  0.291872
25  0.990821  0.480721  0.957579  0.851167  0.029046

In [27]:
random_df.iloc[0,2]

0.33687130866907844

In [4]:
random_df.head(10)

          0         1         2         3         4
0  0.065431  0.763738  0.972725  0.246124  0.039280
1  0.647079  0.931318  0.394388  0.334564  0.453745
2  0.746761  0.459480  0.618362  0.059676  0.528116
3  0.122766  0.050995  0.653692  0.787774  0.572385
4  0.011124  0.145772  0.882842  0.447331  0.346319
5  0.731033  0.958409  0.459826  0.588052  0.150290
6  0.920919  0.304484  0.210452  0.947188  0.153364
7  0.404512  0.440925  0.470345  0.688514  0.130821
8  0.575291  0.097939  0.321355  0.394053  0.236778
9  0.001535  0.237077  0.534894  0.446972  0.681000

In [7]:
random_df.columns  =list('ABCDE')

In [57]:
titanic_data = pd.read_csv('train.csv')

In [ ]:
# t1 length 1000 rows Tsecs
# t2 length 100000 rows

In [63]:
titanic_data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [73]:
random_df.head()

             A         B         C         D
0     0.331376  0.986584  0.760436  0.428159
1  1234.000000  0.456498  0.364181  0.356219
2     0.905016  0.748677  0.548486  0.883466
3     0.895005  0.337776  0.806864  0.984157
4     0.123853  0.740471  0.656942  0.236838

In [72]:
random_df.drop('E',axis=1,inplace=True)

In [9]:
random_df['A'].isnull()

0     False
1     False
2     False
3     False
4     False
5     False
6     False
7     False
8     False
9     False
10    False
11    False
12    False
13    False
14    False
15    False
16    False
17    False
18    False
19    False
20    False
21    False
22    False
23    False
24    False
25    False
26    False
27    False
28    False
29    False
30    False
31    False
32    False
33    False
Name: A, dtype: bool

In [10]:
titanic_data = pd.read_csv('train.csv')

In [12]:
titanic_data.isna().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [75]:
titanic_data['Sex'].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [85]:
titanic_data[titanic_data.select_dtypes(exclude='number').columns]

,Name,Sex,Ticket,Cabin,Embarked
0,"Braund, Mr. Owen Harris",male,A/5 21171,NaN,S
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,PC 17599,C85,C
2,"Heikkinen, Miss. Laina",female,STON/O2. 3101282,NaN,S
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,113803,C123,S
4,"Allen, Mr. William Henry",male,373450,NaN,S
...,...,...,...,...,...
886,"Montvila, Rev. Juozas",male,211536,NaN,S
887,"Graham, Miss. Margaret Edith",female,112053,B42,S
888,"Johnston, Miss. Catherine Helen ""Carrie""",female,W./C. 6607,NaN,S
889,"Behr, Mr. Karl Howell",male,111369,C148,C
890,"Dooley, Mr. Patrick",male,370376,NaN,Q

In [86]:
titanic_data.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

In [90]:
titanic_data['Age'].nunique()

88

In [92]:
titanic_data['Fare'].value_counts()

8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
8.4583      1
9.8375      1
8.3625      1
14.1083     1
17.4000     1
Name: Fare, Length: 248, dtype: int64

In [17]:
# mean,median,mode,correlation,count,max,min,std

In [96]:
titanic_data[titanic_data.select_dtypes(include='number').columns].mean()

PassengerId    446.000000
Survived         0.383838
Pclass           2.308642
Age             29.699118
SibSp            0.523008
Parch            0.381594
Fare            32.204208
dtype: float64

In [97]:
titanic_data[titanic_data.select_dtypes(include='number').columns].median()

PassengerId    446.0000
Survived         0.0000
Pclass           3.0000
Age             28.0000
SibSp            0.0000
Parch            0.0000
Fare            14.4542
dtype: float64

In [98]:
titanic_data[titanic_data.select_dtypes(include='number').columns].max()

PassengerId    891.0000
Survived         1.0000
Pclass           3.0000
Age             80.0000
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

In [116]:
for i in titanic_data[titanic_data.select_dtypes(include='number').columns]:
    print(i,titanic_data[i].mode()[0])

PassengerId 1
Survived 0
Pclass 3
Age 24.0
SibSp 0
Parch 0
Fare 8.05

In [108]:
titanic_data[titanic_data.select_dtypes(include='number').columns].std()

PassengerId    257.353842
Survived         0.486592
Pclass           0.836071
Age             14.526497
SibSp            1.102743
Parch            0.806057
Fare            49.693429
dtype: float64

In [109]:
titanic_data[titanic_data.select_dtypes(include='number').columns].max()

PassengerId    891.0000
Survived         1.0000
Pclass           3.0000
Age             80.0000
SibSp            8.0000
Parch            6.0000
Fare           512.3292
dtype: float64

In [111]:
titanic_data[titanic_data.select_dtypes(include='number').columns].min()

PassengerId    1.00
Survived       0.00
Pclass         1.00
Age            0.42
SibSp          0.00
Parch          0.00
Fare           0.00
dtype: float64

In [117]:
titanic_data[titanic_data.select_dtypes(include='number').columns].corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [19]:
titanic_data['Age'].mean()

29.69911764705882

In [20]:
titanic_data['Age'].median()

28.0

In [21]:
titanic_data['Age'].mode()

0    24.0
dtype: float64

In [134]:
titanic_data.groupby(['Sex']).mean()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
Sex,,,,,,,
female,431.028662,0.742038,2.159236,27.915709,0.694268,0.649682,44.479818
male,454.147314,0.188908,2.389948,30.726645,0.429809,0.235702,25.523893

In [26]:
titanic_data.corr()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
PassengerId,1.000000,-0.005007,-0.035144,0.036847,-0.057527,-0.001652,0.012658
Survived,-0.005007,1.000000,-0.338481,-0.077221,-0.035322,0.081629,0.257307
Pclass,-0.035144,-0.338481,1.000000,-0.369226,0.083081,0.018443,-0.549500
Age,0.036847,-0.077221,-0.369226,1.000000,-0.308247,-0.189119,0.096067
SibSp,-0.057527,-0.035322,0.083081,-0.308247,1.000000,0.414838,0.159651
Parch,-0.001652,0.081629,0.018443,-0.189119,0.414838,1.000000,0.216225
Fare,0.012658,0.257307,-0.549500,0.096067,0.159651,0.216225,1.000000

In [121]:
titanic_data.dropna(axis=0)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
6,7,0,1,"McCarthy, Mr. Timothy J",male,54.0,0,0,17463,51.8625,E46,S
10,11,1,3,"Sandstrom, Miss. Marguerite Rut",female,4.0,1,1,PP 9549,16.7000,G6,S
11,12,1,1,"Bonnell, Miss. Elizabeth",female,58.0,0,0,113783,26.5500,C103,S
...,...,...,...,...,...,...,...,...,...,...,...,...
871,872,1,1,"Beckwith, Mrs. Richard Leonard (Sallie Monypeny)",female,47.0,1,1,11751,52.5542,D35,S
872,873,0,1,"Carlsson, Mr. Frans Olof",male,33.0,0,0,695,5.0000,B51 B53 B55,S
879,880,1,1,"Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)",female,56.0,0,1,11767,83.1583,C50,C
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C

In [124]:
titanic_data.fillna(0).isna().sum()

PassengerId    0
Survived       0
Pclass         0
Name           0
Sex            0
Age            0
SibSp          0
Parch          0
Ticket         0
Fare           0
Cabin          0
Embarked       0
dtype: int64

In [129]:
titanic_data.groupby

<bound method DataFrame.groupby of      PassengerId  Survived  Pclass  \
0              1         0       3
1              2         1       1
2              3         1       3
3              4         1       1
4              5         0       3
..           ...       ...     ...
886          887         0       2
887          888         1       1
888          889         0       3
889          890         1       1
890          891         0       3

                                                  Name     Sex   Age  SibSp  \
0                              Braund, Mr. Owen Harris    male  22.0      1
1    Cumings, Mrs. John Bradley (Florence Briggs Th...  female  38.0      1
2                               Heikkinen, Miss. Laina  female  26.0      0
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)  female  35.0      1
4                             Allen, Mr. William Henry    male  35.0      0
..                                                 ...     ...   ...    ...
886                              Montvila, Rev. Juozas    male  27.0      0
887                       Graham, Miss. Margaret Edith  female  19.0      0
888           Johnston, Miss. Catherine Helen "Carrie"  female   NaN      1
889                              Behr, Mr. Karl Howell    male  26.0      0
890                                Dooley, Mr. Patrick    male  32.0      0

     Parch            Ticket     Fare Cabin Embarked
0        0         A/5 21171   7.2500   NaN        S
1        0          PC 17599  71.2833   C85        C
2        0  STON/O2. 3101282   7.9250   NaN        S
3        0            113803  53.1000  C123        S
4        0            373450   8.0500   NaN        S
..     ...               ...      ...   ...      ...
886      0            211536  13.0000   NaN        S
887      0            112053  30.0000   B42        S
888      2        W./C. 6607  23.4500   NaN        S
889      0            111369  30.0000  C148        C
890      0            370376   7.7500   NaN        Q

[891 rows x 12 columns]>